import random

print("***ПРАВИЛА ГРИ:\n***Спочатку ви маєте ввести кількість фішок, які хочете поставити.\n***Потім ввести межі можливого випадкового числа.\n***Потім спробуйте вгадати це число.\n***Ставка згорить, якщо вам не вдасться відгадати число.\n***Але ви отримаєте нагороду, якщо його буде відгадано!\n***Нагорода змінюється в залежності від поставлених меж.\n***Ваша ціль - 100 фішок. Нехай щастить!")

def mf():
    points = 25

    while 0 < points < 100:
        try:
            print('\n***Наразі у вас є {} фішок(фішки)'.format(points))
            bet = int(input('\n---Ваша ставака: '))
            if 0 <= bet <= points:
                print('---Уведіть межі(Від (x), до (y))')
                x = int(input('---Від (x): '))
                y = int(input('---До (y): '))
                rand_num = random.randint(x, y)
                a = int(input('---Уведіть ваше число: '))
                points = points - bet
                points_range = y - x + 1

                if a >= x and a <= y and x != y:           
                    if a == rand_num:
                        points = points + bet*points_range
                        print("\n***Перемога***")
                    else:
                        print("\n***Ви програли***")
                else:
                    print("!!!Ваше число повинно належати проміжку від 'x' до 'y'!!!\n!!!'x' Повинно бути числом меншим за 'y'!!!\n\n***Спробуй ще раз***")
            else:
                print('\n!!!Ставка некоректна!!!')


        except ValueError:
            print("\n!!!Щось пішло не так!!!\n!!!Ставка має бути подана у вигляді кількості фішок!!!\n!!!'x' Повинно бути числом меншим за 'y'!!!\n!!!Ви повинні ввести число, що належить заданому проміжку!!!\n\n***Спробуйте ще раз***")

        

    if points >= 100:
        print('\n***Ви вже маєте 100 фішок. Це перемога!***')
    elif points <= 0:
        print('\n***У вас не залишилося фішок***')

mf()


while True:
    again_yes_or_no = input("\n***Ви можете ввести 'т', щоб запустити заново, або будь-що інше, аби завершити.\n---Заново?: ")

    if again_yes_or_no == 'т':
        mf()
    else:
        break
